{"class_name": "Model", "config": {"name": "D_chain_1", "layers": [{"name": "input_34", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 256], "dtype": "float32", "sparse": false, "name": "input_34"}, "inbound_nodes": []}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"name": "leaky_re_lu_26", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "average_pooling2d_12", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}], "input_layers": [["input_34", 0, 0]], "output_layers": [["average_pooling2d_12", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}