{"class_name": "Model", "config": {"name": "G_chain_3", "layers": [{"name": "input_64", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 512], "dtype": "float32", "sparse": false, "name": "input_64"}, "inbound_nodes": []}, {"name": "up_sampling2d_5", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["input_64", 0, 0, {}]]]}, {"name": "conv2d_50", "class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"name": "apply_noise_11", "class_name": "ApplyNoise", "config": {"name": "apply_noise_11", "trainable": true, "dtype": "float32", "noise_generating_rule": "loaded_from_outer_model", "fils": 512, "noise_func": "random_normal", "noise_args": [], "noise_keywords": {"mean": 0, "stddev": 0.5}}, "inbound_nodes": [[["conv2d_50", 0, 0, {}]]]}, {"name": "input_63", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_63"}, "inbound_nodes": []}, {"name": "ada_in_11", "class_name": "AdaIN", "config": {"name": "ada_in_11", "trainable": true, "dtype": "float32", "input_dim": 512, "units": 512, "axis": -1, "momentum": 0.99, "epsilon": 1e-07, "center": true, "scale": true}, "inbound_nodes": [[["apply_noise_11", 0, 0, {}], ["input_63", 0, 0, {}]]]}, {"name": "conv2d_51", "class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["ada_in_11", 0, 0, {}]]]}, {"name": "apply_noise_12", "class_name": "ApplyNoise", "config": {"name": "apply_noise_12", "trainable": true, "dtype": "float32", "noise_generating_rule": "loaded_from_outer_model", "fils": 512, "noise_func": "random_normal", "noise_args": [], "noise_keywords": {"mean": 0, "stddev": 0.5}}, "inbound_nodes": [[["conv2d_51", 0, 0, {}]]]}, {"name": "ada_in_12", "class_name": "AdaIN", "config": {"name": "ada_in_12", "trainable": true, "dtype": "float32", "input_dim": 512, "units": 512, "axis": -1, "momentum": 0.99, "epsilon": 1e-07, "center": true, "scale": true}, "inbound_nodes": [[["apply_noise_12", 0, 0, {}], ["input_63", 0, 0, {}]]]}], "input_layers": [["input_64", 0, 0], ["input_63", 0, 0]], "output_layers": [["ada_in_12", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}