{"class_name": "Model", "config": {"name": "G_chain_1", "layers": [{"name": "input_46", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 512], "dtype": "float32", "sparse": false, "name": "input_46"}, "inbound_nodes": []}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["input_46", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "apply_noise_7", "class_name": "ApplyNoise", "config": {"name": "apply_noise_7", "trainable": true, "dtype": "float32", "noise_generating_rule": "loaded_from_outer_model", "fils": 256, "noise_func": "random_normal", "noise_args": [], "noise_keywords": {"mean": 0, "stddev": 0.5}}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "input_45", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_45"}, "inbound_nodes": []}, {"name": "ada_in_7", "class_name": "AdaIN", "config": {"name": "ada_in_7", "trainable": true, "dtype": "float32", "input_dim": 512, "units": 256, "axis": -1, "momentum": 0.99, "epsilon": 1e-07, "center": true, "scale": true}, "inbound_nodes": [[["apply_noise_7", 0, 0, {}], ["input_45", 0, 0, {}]]]}, {"name": "conv2d_39", "class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["ada_in_7", 0, 0, {}]]]}, {"name": "apply_noise_8", "class_name": "ApplyNoise", "config": {"name": "apply_noise_8", "trainable": true, "dtype": "float32", "noise_generating_rule": "loaded_from_outer_model", "fils": 256, "noise_func": "random_normal", "noise_args": [], "noise_keywords": {"mean": 0, "stddev": 0.5}}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"name": "ada_in_8", "class_name": "AdaIN", "config": {"name": "ada_in_8", "trainable": true, "dtype": "float32", "input_dim": 512, "units": 256, "axis": -1, "momentum": 0.99, "epsilon": 1e-07, "center": true, "scale": true}, "inbound_nodes": [[["apply_noise_8", 0, 0, {}], ["input_45", 0, 0, {}]]]}], "input_layers": [["input_46", 0, 0], ["input_45", 0, 0]], "output_layers": [["ada_in_8", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}