{"class_name": "Model", "config": {"name": "input_layers_2_for_D", "layers": [{"name": "input_52", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 3], "dtype": "float32", "sparse": false, "name": "input_52"}, "inbound_nodes": []}, {"name": "conv2d_46", "class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_52", 0, 0, {}]]]}, {"name": "leaky_re_lu_33", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_33", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_46", 0, 0, {}]]]}], "input_layers": [["input_52", 0, 0]], "output_layers": [["leaky_re_lu_33", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}