{"class_name": "Model", "config": {"name": "input_layers_2_for_G", "layers": [{"name": "input_56", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_56"}, "inbound_nodes": []}, {"name": "input_57", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_57"}, "inbound_nodes": []}, {"name": "normalize_4", "class_name": "Normalize", "config": {"name": "normalize_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_56", 0, 0, {}]]]}, {"name": "normalize_5", "class_name": "Normalize", "config": {"name": "normalize_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_57", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["normalize_4", 0, 0, {}]], [["normalize_5", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_11", 0, 0, {}]], [["dense_11", 1, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_12", 0, 0, {}]], [["dense_12", 1, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_13", 0, 0, {}]], [["dense_13", 1, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_14", 0, 0, {}]], [["dense_14", 1, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_15", 0, 0, {}]], [["dense_15", 1, 0, {}]]]}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_16", 0, 0, {}]], [["dense_16", 1, 0, {}]]]}, {"name": "input_55", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_55"}, "inbound_nodes": []}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["dense_17", 0, 0, {}]], [["dense_17", 1, 0, {}]]]}, {"name": "learned_const_tensor_2", "class_name": "LearnedConstTensor", "config": {"name": "learned_const_tensor_2", "trainable": true, "dtype": "float32", "shape": [4, 4, 512]}, "inbound_nodes": [[["input_55", 0, 0, {}]]]}, {"name": "mix_style_5", "class_name": "MixStyle", "config": {"step": 0, "n_inp_w": 2, "n_g_block": 3, "name": "mix_style_5", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["dense_18", 0, 0, {}], ["dense_18", 1, 0, {}]]]}, {"name": "mix_style_6", "class_name": "MixStyle", "config": {"step": 1, "n_inp_w": 2, "n_g_block": 3, "name": "mix_style_6", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["dense_18", 0, 0, {}], ["dense_18", 1, 0, {}]]]}, {"name": "mix_style_7", "class_name": "MixStyle", "config": {"step": 2, "n_inp_w": 2, "n_g_block": 3, "name": "mix_style_7", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["dense_18", 0, 0, {}], ["dense_18", 1, 0, {}]]]}], "input_layers": [["input_55", 0, 0], ["input_56", 0, 0], ["input_57", 0, 0]], "output_layers": [["learned_const_tensor_2", 0, 0], ["mix_style_5", 0, 0], ["mix_style_6", 0, 0], ["mix_style_7", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}