{"class_name": "Model", "config": {"name": "merge_layers_2_for_D", "layers": [{"name": "input_53", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 3], "dtype": "float32", "sparse": false, "name": "input_53"}, "inbound_nodes": []}, {"name": "average_pooling2d_14", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_14", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"name": "input_layers_1_for_D", "class_name": "Model", "config": {"name": "input_layers_1_for_D", "layers": [{"name": "input_37", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 3], "dtype": "float32", "sparse": false, "name": "input_37"}, "inbound_nodes": []}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_37", 0, 0, {}]]]}, {"name": "leaky_re_lu_30", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}], "input_layers": [["input_37", 0, 0]], "output_layers": [["leaky_re_lu_30", 0, 0]]}, "inbound_nodes": [[["average_pooling2d_14", 0, 0, {}]]]}, {"name": "input_54", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 256], "dtype": "float32", "sparse": false, "name": "input_54"}, "inbound_nodes": []}, {"name": "weighted_sum_2_for_D", "class_name": "WeightedSum", "config": {"alpha": 1.0, "alpha_step": 0.0001, "name": "weighted_sum_2_for_D", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["input_layers_1_for_D", 1, 0, {}], ["input_54", 0, 0, {}]]]}], "input_layers": [["input_53", 0, 0], ["input_54", 0, 0]], "output_layers": [["weighted_sum_2_for_D", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}