{"class_name": "Model", "config": {"name": "merge_layers_3_for_G", "layers": [{"name": "input_72", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 512], "dtype": "float32", "sparse": false, "name": "input_72"}, "inbound_nodes": []}, {"name": "output_layers_2_for_G", "class_name": "Model", "config": {"name": "output_layers_2_for_G", "layers": [{"name": "input_58", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 16, 512], "dtype": "float32", "sparse": false, "name": "input_58"}, "inbound_nodes": []}, {"name": "conv2d_47", "class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_58", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "tanh"}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}], "input_layers": [["input_58", 0, 0]], "output_layers": [["activation_5", 0, 0]]}, "inbound_nodes": [[["input_72", 0, 0, {}]]]}, {"name": "up_sampling2d_6", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_6", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["output_layers_2_for_G", 1, 0, {}]]]}, {"name": "input_73", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_73"}, "inbound_nodes": []}, {"name": "weighted_sum_3_for_G", "class_name": "WeightedSum", "config": {"alpha": 1.0, "alpha_step": 0.0001, "name": "weighted_sum_3_for_G", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}], ["input_73", 0, 0, {}]]]}], "input_layers": [["input_72", 0, 0], ["input_73", 0, 0]], "output_layers": [["weighted_sum_3_for_G", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}