{"class_name": "Model", "config": {"name": "output_layers_3_for_G", "layers": [{"name": "input_71", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 512], "dtype": "float32", "sparse": false, "name": "input_71"}, "inbound_nodes": []}, {"name": "conv2d_54", "class_name": "Conv2D", "config": {"name": "conv2d_54", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_71", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "activation": "tanh"}, "inbound_nodes": [[["conv2d_54", 0, 0, {}]]]}], "input_layers": [["input_71", 0, 0]], "output_layers": [["activation_6", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}