{"class_name": "Model", "config": {"name": "output_layers_3_for_D", "layers": [{"name": "input_38", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 4, 256], "dtype": "float32", "sparse": false, "name": "input_38"}, "inbound_nodes": []}, {"name": "mini_batch_standard_deviation_2", "class_name": "MiniBatchStandardDeviation", "config": {"name": "mini_batch_standard_deviation_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["mini_batch_standard_deviation_2", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "linear"}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}], "input_layers": [["input_38", 0, 0]], "output_layers": [["activation_3", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}